Repository: XavierSoh/skfx
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Hello World!
fr: Bonjour le monde

# welcomeTitle
source: WELCOME TO MY PORTFOLIO!
fr: BIENVENUE SUR MA PAGE!

# flutterDev
source: Flutter Developer
fr: Développeur Flutter

# kotlinDev
source: Kotlin Developer
fr: Développeur Kotlin

# javaDev
source: Java Developer
fr: Développeur Java

# googleEn
source: Google Enthusiast
fr: Passionné de Google

source: A friend :)
fr: Votre partenaire :)

source: About Me
fr: A propos de Moi

# getKnowMe
source: Get to know me :)
fr: Apprendre à me connaître :)

# whoIAm
source: Who am I?
fr: Qui suis-je?

# techIWorkedWith
source: Technologies I have worked with:
fr: Technologies avec lesquelles j'ai travaillé :

source: My Resume
fr: Mon CV

# aboutMeHeadline
source: I'm Xavier Soh, a Flutter, Kotlin and Java developer. Computer Network Engineer
fr: Je suis Xavier Soh, Programmeur et Ingénieur en réseaux informatiques

# aboutMeDetail
source: I am a mobile developer trained by google on the Udacity platform, accredited by a certification from the "Android Developers Nanodegree" program with the Java language. I also trained on Dr. Angela Yu's App Brewery School platform, accredited by the Flutter developer certification. In 5 years of experience, I have developed several software solutions for companies and customers. I have worked in teams for various startup and helped them in launching their prototypes and got a valuable learning experience. I also work as an engineer in computer networks and telecommunications. Currently, I'm working on an PGI solution, and I'm preparing for my Google Kotlin Certification exam.
fr: Je suis un développeur mobile formé par Google sur la plateforme Udacity dans le cadre du programme "Android Developers Nanodegree" avec le langage Java. Je me suis également formé sur la plateforme App Brewery School du Dr Angela Yu, accrédité par une certification de développeur Flutter avancé. Mais avant, je suis Ingénieur en Réseaux Informatiques et je possède un Diplôme de Technicien Supérieur en Télécommunications et Réseaux. En 5 ans d'expérience dans la technologie, j'ai développé plusieurs solutions logicielles pour des entreprises et des clients. J'ai travaillé en équipe pour diverses startups et je les ai aidé à lancer leurs prototypes. J'ai crée, administré et maintenu des résaux informatiques en passant par la vidéo surveillance, le déploiement de la Fibre optique avec la technologie FTTH GPON et la maintenance des systèmes informatiques. J'ai ainsi acquis une précieuse expérience d'apprentissage. Mes connaissances acquises en Marketing Digital grâce au programme <Google Digital> me permettent de travailler comme développeur indépendant. Je suis rigoureux, passionné par ce que je fais et je respecte les délais de livraison. Actuellement, je travaille sur une solution PGI, et je prépare l'examen de Certification Google Kotlin.

# mobileAppDev
source: Mobile App Development
fr: Développement Mobile

# responsiveWebsiteDev
source: Responsive Website Development
fr: Création de sites web Responsives

# uiUx
source: UI/UX Designing
fr: Design UI/UX

source: Rapid Prototyping
fr: Prototypage Rapide

# viaFlutter
source: Android app development via Flutter, Java & Kotlin -Chat apps Firebase Auth/Cloud - REST APIs - Maps integration and more...!
fr: Développement d'applications Android avec Flutter, Applications de chat avec Java et Kotlin Firebase Auth/Cloud - APIs REST - Intégration de cartes et plus...!

# websiteCreator
source: Website creator - E-commerce - Blogs - Landing pages
fr: Créateur de site Web - E-commerce - Blogs - Landing pages

# modernUI
source: Modern UI/UX Designing - Mobile & Web designs - Interactive UI designs - Responsiveness - Promo Videos and more..!
fr: UI/UX Design Moderne - Mobile & Web designs - UI designs Interactifs - Réactivité - Vidéos promotionnelles et plus..!

# rapidPrototypeDesc
source: Rapid Prototype via Flutter, Java & Kotlin - Working MVP - Quick & Working prototype
fr: Prototype rapide via Flutter, Java & Kotlin - Working MVP - Prototype rapide et fonctionnel

source: Hey there
fr: Salut je suis

source: Get in Touch
fr: Contactez moi

# buildTogether
source: Construisons quelque chose ensemble :)
fr: Et construisons quelque chose ensemble :)

source: What I Can Do?
fr: Ce Que Je Peux Faire?

# mayNotBePerfect
source: I may not be perfect but I will surely be of some use to you :)
fr: Je ne suis peut-être pas parfait mais je vous serai sûrement d'une certaine utilité :)

source: Hire Me!
fr: Engagez moi!

source: Back
fr: Retour
